const list = [
    {
        id: 'gel',
        font: 'Gҽɳҽɾαʅ',
        emoji: '🔰'
    },
    {
        id: 'v',
        font: 'Dҽʋ',
        emoji: '👨‍💻'
    },
    {
        id: 'n',
        font: 'Fυɳ',
        emoji: '🎡'
    },
    {
        id: 'sic',
        font: 'Mυʂιƈ',
        emoji: '💠'
    },
    {
        id: 'dia',
        font: 'Mҽԃια',
        emoji: '🔉'
    },
    {
        id: 'mation',
        font: 'Mσԃҽɾαƚισɳ',
        emoji: '💮'
    },
    {
        id: 'ils',
        font: 'Uƚιʅʂ',
        emoji: '⚙️'
    },
    {
        id: 'eb',
        font: 'WҽҽႦ',
        emoji: '🎐'
    }
]

module.exports = {
    name: 'help',
    aliases: ['h', 'menu', 'list', 'commands'],
    category: 'general',
    exp: 10,
    description: 'Let you see the command list',
    async execute(client, flag, arg, M) {
        console.log(arg)
        if (!arg) {
            let obj = {}
            client.cmd.forEach((item) => {
                if (obj[item.category]) obj[item.category].push(item.name)
                else {
                    obj[item.category] = []
                    obj[item.category].push(item.name)
                }
            })
            let base = `◯────────────●
       ᎠᎪᎡᏦ ᎪᏞҒᎻᎪ  Ꮙ2
 ●────────────◯

 ʜɪ @${M.sender.split('@')[0]}
    ˢᵘᵇˢᶜʳⁱᵇᵉ ᵐʸ ʸᵒᵘ ᵗᵘᵇᵉ ᶜʰᵃⁿᵉˡ〴
    www.youtube.com/@DeepEagle
`
            base += '●───────────────\n༗ 𝐰𝐞𝐥𝐜𝐨𝐦𝐞 𝐭𝐨 𝐝𝐚𝐫𝐤 𝐚𝐥𝐟𝐡𝐚 𝐦𝐚𝐧𝐮 ࿐ \n ───────────────●'
           
            base += '\n\n'
            base += `▎❡ᴏᴡɴᴇʀ ᴄᴏᴍᴍᴀɴᴅ ▎
    ────────────
 ▏↳ ❖ ᏴᎪΝ
 ▏────────────
 ▏ ↳ ❖ ᏴᎡϴᎪᎠᏟᎪՏͲ
 ▏────────────
 ▏  ↳ ❖ ᎬᏙᎪᏞ
 ▏────────────
 ▏ ↳ ❖ ᎫϴᏆΝ
 ▏────────────
 ▏ ↳ ❖ ᏞᎬᎪᏙᎬ
 ▏────────────
 ▏ ↳ ❖ ႮΝᏴᎪΝ
 ▏────────────
 ▏ ↳ ❖ ႮᏢᎠᎪͲᎬՏ
 ▏────────────

▎❡ɢᴇɴᴀʀʟ ᴄᴏᴍᴍᴀɴᴅ ▎
   ────────────

 ▏↳ ❖ ᎠᎬᏞᎬͲᎬ
 ▏────────────
 ▏↳ ❖ ᎻᎬᏞᏢ
 ▏────────────
 ▏↳ ❖ ᏆΝҒϴᎡᎷᎪͲᏆϴΝ
 ▏────────────
 ▏↳ ❖ 𝚂𝙲𝚁𝙸𝙿𝚃
 ▏────────────
 ▏ ↳ ❖ ᏢᎡϴҒᏆᏞᎬ
 ▏────────────

▎❡ᴅᴏᴡɴʟᴏᴀᴅ ᴄᴏᴍᴍᴀɴᴅ▎
      ────────────

 ▏────────────
 ▏↳ ❖ ՏϴΝᏀ 
 ▏────────────
 ▏↳ ❖ ᎽͲՏᎬᎪᎡᏟᎻ
 ▏────────────
 ▏↳ ❖ ᏙᏆᎠᎬϴ
 ▏────────────

 ▎❡ ɢʀᴏᴜᴘ ᴄᴏᴍᴍᴀɴᴅ ▎
    ────────────
 ▏↳ ❖ ᎪᏟͲᏆᏙᎪͲᎬ
 ▏────────────
 ▏↳ ❖ ᎠᎬᎪᏟͲᏆᏙᎪͲᎬ
 ▏────────────
 ▏  ↳ ❖ ᎠᎬᎷϴͲᎬ
 ▏────────────
 ▏ ↳ ❖ ᏀᎡϴႮᏢ
 ▏────────────
 ▏ ↳ ❖ ᏆΝᏙᏆͲᎬ
 ▏────────────
 ▏ ↳ ❖ ᏢᎡϴᎷϴͲᎬ
 ▏────────────
 ▏ ↳ ❖ ᏦᏆᏟᏦ
 ▏────────────
 ▏ ↳ ❖ ᎡᎬᏙϴᏦᎬ
 ▏────────────
 ▏ ↳ ❖ ͲᏀᎪᏞᏞ
 ▏────────────

 ▎❡ ᴡᴏᴋɪɴɢ ᴛᴇꜱᴛᴄ ▎
 ────────────
 ▏↳ ❖ ᎻᎬᎡϴ
 ▏────────────
 ▏↳ ❖ ᏢᏆΝᏀ 
 ▏────────────
 ▏↳ ❖ ՏͲᎪͲՏ
 ▏────────────

 ▎❡ ꜱᴇᴀʀᴄʜ ᴄᴏᴍᴍᴀɴᴅ ▎
    ────────────
 ▏↳ ❖ ͲϴᏆᎷᏀ
 ▏────────────
 ▏↳ ❖ ᏀᎬͲᏀᏆҒ
 ▏────────────
 ▏↳ ❖ ᏀϴϴᏀᏞᎬ
 ▏────────────
 ▏↳ ❖ ᏀᏢͲ 
 ▏────────────
 ▏↳ ❖ ᏆᎷᎪᏀᎬՏᎬᎡᏟᎻ
 ▏────────────
 ▏↳ ❖ ᎡᎬᎷϴᏙᎬᏴᏀ
 ▏────────────
 ▏↳ ❖ ՏͲᎬᎪᏞ
 ▏────────────
 ▏↳ ❖ ՏͲᏆᏦᎬᎡ
 ▏────────────
 ▏↳ ❖ ՏႮᏴᎡᎬᎪᎠᎠᏆͲ
 ▏────────────
 ▏↳ ❖ ͲᎬХͲͲϴՏᏢᎬᎬᏟᎻ
 ▏────────────
 ▏↳ ❖ ͲᎡᎪΝՏᏞᎪͲᎬ
 ▏────────────
 ▎❡ᴏᴡɴᴇʀ ᴄᴏᴍᴍᴀɴᴅ ▎
    ────────────
 ▏↳ ❖ ᏴᎪΝ
 ▏────────────
 ▏ ↳ ❖ ᏴᎡϴᎪᎠᏟᎪՏͲ
 ▏────────────
 ▏  ↳ ❖ ᎬᏙᎪᏞ
 ▏────────────
 ▏ ↳ ❖ ᎫϴᏆΝ
 ▏────────────
 ▏ ↳ ❖ ᏞᎬᎪᏙᎬ
 ▏────────────
 ▏ ↳ ❖ ႮΝᏴᎪΝ
 ▏────────────
 ▏ ↳ ❖ ႮᏢᎠᎪͲᎬՏ
 ▏────────────

▎❡ɢᴇɴᴀʀʟ ᴄᴏᴍᴍᴀɴᴅ ▎
   ────────────

 ▏↳ ❖ ᎠᎬᏞᎬͲᎬ
 ▏────────────
 ▏↳ ❖ ᎻᎬᏞᏢ
 ▏────────────
 ▏↳ ❖ ᏆΝҒϴᎡᎷᎪͲᏆϴΝ
 ▏────────────
 ▏↳ ❖ ᏞᎬᎪᎠᎬᎡᏴϴᎪᎡᎠ
 ▏────────────
 ▏ ↳ ❖ ᏢᎡϴҒᏆᏞᎬ
 ▏────────────
 ▏ ↳ ❖ ᎡᎪΝᏦ
 ▏────────────

▎❡ᴅᴏᴡɴʟᴏᴀᴅ ᴄᴏᴍᴍᴀɴᴅ▎
      ────────────

 ▏↳ ❖ ՏᏢϴͲᏆҒᎽ
 ▏────────────
 ▏↳ ❖ ՏϴΝᏀ 
 ▏────────────
 ▏↳ ❖ ᎽͲՏᎬᎪᎡᏟᎻ
 ▏────────────
 ▏↳ ❖ ᏙᏆᎠᎬϴ
 ▏────────────

 ▎❡ ɢʀᴏᴜᴘ ᴄᴏᴍᴍᴀɴᴅ ▎
    ────────────
 ▏↳ ❖ ᎪᏟͲᏆᏙᎪͲᎬ
 ▏────────────
 ▏↳ ❖ ᎠᎬᎪᏟͲᏆᏙᎪͲᎬ
 ▏────────────
 ▏  ↳ ❖ ᎠᎬᎷϴͲᎬ
 ▏────────────
 ▏ ↳ ❖ ᏀᎡϴႮᏢ
 ▏────────────
 ▏ ↳ ❖ ᏆΝᏙᏆͲᎬ
 ▏────────────
 ▏ ↳ ❖ ᏢᎡϴᎷϴͲᎬ
 ▏────────────
 ▏ ↳ ❖ ᏦᏆᏟᏦ
 ▏────────────
 ▏ ↳ ❖ ᎡᎬᏙϴᏦᎬ
 ▏────────────
 ▏ ↳ ❖ ͲᎪᏀᎪᏞᏞ
 ▏────────────

 ▎❡ ᴡᴏᴋɪɴɢ ᴛᴇꜱᴛᴄ ▎
 ────────────
 ▏↳ ❖ 𝓐ℒ𝓘𝓥𝓔
 ▏────────────
 ▏↳ ❖ ᏢᏆΝᏀ 
 ▏────────────
 ▏↳ ❖ ՏͲᎪͲՏ
 ▏────────────

 ▎❡ ꜱᴇᴀʀᴄʜ ᴄᴏᴍᴍᴀɴᴅ ▎
    ────────────
 ▏↳ ❖ ͲϴᏆᎷᏀ
 ▏────────────
 ▏↳ ❖ ᏀᎬͲᏀᏆҒ
 ▏────────────
 ▏↳ ❖ ᏀϴϴᏀᏞᎬ
 ▏────────────
 ▏↳ ❖ ᏀᏢͲ 
 ▏────────────
 ▏↳ ❖ ᏆᎷᎪᏀᎬՏᎬᎡᏟᎻ
 ▏────────────
 ▏↳ ❖ ᎡᎬᎷϴᏙᎬᏴᏀ
 ▏────────────
 ▏↳ ❖ ՏͲᎬᎪᏞ
 ▏────────────
 ▏↳ ❖ ՏͲᏆᏦᎬᎡ
 ▏────────────
 ▏↳ ❖ ՏႮᏴᎡᎬᎪᎠᎠᏆͲ
 ▏────────────
 ▏↳ ❖ ͲᎬХͲͲϴՏᏢᎬᎬᏟᎻ
 ▏────────────
 ▏↳ ❖ ͲᎡᎪΝՏᏞᎪͲᎬ
 ▏────────────`
            const url = 'https://i.ibb.co/SVbyxZG/1691320469926.jpg'
            const buffer = await client.utils.getBuffer(url)
            await client.sendMessage(
                M.from,
                {
                    image: buffer,
                    caption: base,
                    mentions: [M.sender]
                },
                {
                    quoted: M
                }
            )
            return
        }
        const command = client.cmd.get(arg) || client.cmd.find((cmd) => cmd.aliases && cmd.aliases.includes(arg))
        if (!command) return M.reply('Command does not exsist')
        M.reply(
            `*CMD INFO*\n\n*🟥 Name:* ${command.name}\n*🟩 Aliases:* ${command.aliases}\n*🟨 Desc:* ${command.description}`
        )
    }
}
